Repository: asir2004/animate-
Catalog: Animate!.swiftpm/Model/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: 12 Basic Animation Principles
zh_hans: 十二动画原则

source: About Me
zh_hans: 关于我

source: Anchor Point
zh_hans: 锚点

# ANCHOR_POINT_SCREEN_SECTION_1_DETAIL
source: In animation, anchor point is a point where animation plays. The animated property (e.g. scaling, rotation, position…) of an object is recorded on its anchor point, properties like scale and rotation change relatively to that point. Remember the material point you learned from physics class? They are almost the same in function. Try it below!
zh_hans: 在动画中，锚点是动画播放的点。对象的动画属性（例如缩放、旋转、位置等）记录在其锚点上，诸如缩放和旋转之类的属性相对于该点改变。还记得你在物理课上学到的质点吗？它们在功能上几乎相同。试试以下示例！

# ANCHOR_POINT_SCREEN_SECTION_1_TITLE
source: What is Anchor Point?
zh_hans: 什么是锚点？

# ANCHOR_POINT_SCREEN_SECTION_2_DETAIL_1
source: 1. **Rotation**: A clock hand rotates surrounding the center of the clock.
zh_hans: 1. **旋转**：时钟的指针围绕时钟的中心旋转。

# ANCHOR_POINT_SCREEN_SECTION_2_DETAIL_2
source: 2. **Scaling**: Imagine a growing rectangle, if you stuck one of its corners to a corner of walls, the rectangle will grow oppositely the wall corner way. That corner is the anchor point of that growing (scaling) progress.
zh_hans: 2. **缩放**：想象一个不断增长的矩形，如果你将它的一个角固定在墙角，矩形会朝着与墙角相反的方向增长。那个角就是该增长（缩放）过程的锚点。

# ANCHOR_POINT_SCREEN_SECTION_2_TITLE
source: Some Examples?
zh_hans: 一些示例

# ANCHOR_POINT_SCREEN_SECTION_3_DETAIL
source: There′s more to learn in the animation world…
zh_hans: 在动画世界中还有更多要学习的内容……

# ANCHOR_POINT_SCREEN_SECTION_3_TITLE
source: What′s Next…?
zh_hans: 接下来…

source: Animated Value
zh_hans: 值

source: Animation
zh_hans: 动画

# ANIMATION_SCREEN_SECTION_1_DETAIL
source: In fact, animation is a sequence of pictures which shift quickly, then your brain blends them together let you feel they are moving. In professional terms, this is called persistence of vision.
zh_hans: 实际上，动画是一系列快速切换的图片，然后你的大脑将它们混合在一起，让你觉得它们在移动。在专业术语中，这被称为视觉暂留。

# ANIMATION_SCREEN_SECTION_1_TITLE
source: How we see animation?
zh_hans: 我们是如何看见动画的？

# ANIMATION_SCREEN_SECTION_2_DETAIL_1
source: Animation makes characters come alive in movies, games and other literary and artistic works.
zh_hans: 动画使得电影、游戏和其他文学艺术作品中的角色栩栩如生。

# ANIMATION_SCREEN_SECTION_2_DETAIL_2
source: Animation in education makes explaining some theories simple.
zh_hans: 在教育中使用动画能够直观地解释一些理论。

# ANIMATION_SCREEN_SECTION_2_DETAIL_3
source: Animation makes ads eye-catching.
zh_hans: 动画使广告更具吸引力。

# ANIMATION_SCREEN_SECTION_2_DETAIL_4
source: Using great animations can make user experience (UX) higher level.
zh_hans: 使用精美的动画可以提升用户体验。

# ANIMATION_SCREEN_SECTION_2_TITLE
source: Where are animations used for?
zh_hans: 动画被用于什么呢？

# ANIMATION_SCREEN_SECTION_3_DETAIL_1
source: **Visual Feedback**: Proper use of animations can give users a clear feedback, let them know an action is complete.
zh_hans: **视觉反馈**：恰当地使用动画可以为用户提供清晰的反馈，让他们知道一个操作已经完成。

# ANIMATION_SCREEN_SECTION_3_DETAIL_2
source: **Fun and Delight**: Interesting animations can tell a delighting story in your app, let users put their own minds into it.
zh_hans: **增添趣味性**：有趣的动画可以在您的应用中讲述一个令人愉快的故事，让用户投入其中。

# ANIMATION_SCREEN_SECTION_3_DETAIL_3
source: **Unique Brand Identity**: If you have watched many ads made by tech companies, you can find them unique, like when you see the San Francisco font, you′ll know the ad is Apple′s, even you might haven′t watched the ad yet. Different companies have different animating method.
zh_hans: **独特化品牌标识**：如果你看过许多科技公司制作的广告，你会发现它们都有自己独特的韵味。比如当你看到 SF / 苹方字体时，你会知道这是苹果公司的广告，即使你可能还没有看过这个广告。而且不同的公司有不同的动画方式。

# ANIMATION_SCREEN_SECTION_3_TITLE
source: Using great animations in your app can bring:
zh_hans: 在你的 app 中使用优秀的动画可以带来：

# ANIMATION_SCREEN_SECTION_4_DETAIL
source: We usually use keyframes to make animations.
zh_hans: 我们通常使用关键帧来制作动画。

# ANIMATION_SCREEN_SECTION_4_TITLE
source: So how we make it?
zh_hans: 所以我们如何制作动画？

source: Animation Type
zh_hans: 动画类型

source: Circle Animation
zh_hans: 小球的动画

source: Congratulations!
zh_hans: 恭喜！

source: Continue
zh_hans: 下一步

source: Continue: Anchor Point
zh_hans: 继续学习：锚点

# CONTINUE_ANIMATION_TRIP
source: Continue: The Endless Animation Trip
zh_hans: 终点，起点。

source: Continue: Keyframe
zh_hans: 继续学习：关键帧

# CONTINUE_NON_LINEAR_ANIMATION
source: Continue: Linear and Non-linear Animation
zh_hans: 继续学习：非线性动画

# CONTINUE_SWIFTUI_ANIMATIONS
source: Continue: Discover Different Kinds of Animation in SwiftUI
zh_hans: 继续学习：SwiftUI 中不同的动画类型

# CONTINUE_SWIFTUI_CODE
source: Continue: Make it in SwiftUI
zh_hans: 继续学习：在 SwiftUI 中实现

source: Continue: Time-Value Chart
zh_hans: 继续学习：关键帧速度图表

# CONTINUE_VARIOUS_CHARTS
source: Continue: Discover Various Animations′ Time-Value Chart
zh_hans: 继续：探索不同的速度曲线

# CREDITS_USED
source: Credits / Material used
zh_hans: 参考资料

# DIFFERENT_KINDS_OF_CHART
source: Different Kinds of Time-Value Chart
zh_hans: 不同的关键帧图表

source: Discover
zh_hans: 探索

source: Do It Yourself!
zh_hans: 试一试！

source: Ease-In
zh_hans: 渐入

# EASE_IN_EXPLANATIONS
source: The object gradually increases its velocity after animation starts.
zh_hans: 动画在开始时速度较慢，然后逐渐加快的效果。

source: Ease-In-Out
zh_hans: 渐入渐出

# EASE_IN_OUT_EXPLANATIONS
source: The combination of ease-in and ease-out animation.
zh_hans: 渐入和渐出的组合。

source: Ease-Out
zh_hans: 渐出

# EASE_OUT_EXPLANATIONS
source: The object gradually decreases its velocity before animation ends.
zh_hans: 动画在开始时速度较快，然后逐渐减速的效果。

# ENDING_SCREEN_SECTION_1_DETAIL
source: You have finished the introduction to animation! You can now apply the knowledge to your keynotes, apps, web designs and videos!
zh_hans: 你已经完成了动画介绍！现在可以将这些知识应用到你的演示文稿、应用程序、网页设计和视频中！

# ENDING_SCREEN_SECTION_1_TITLE
source: Not the End…
zh_hans: 动画之程还远不到终点

# ENDING_SCREEN_SECTION_2_DETAIL_1
source: You can now open creative apps, like Motion by Apple, try adding some keyframes to a layer, adjusting keyframe′s velocity factor. As you watch and make more animations, you′ll start feeling animation′s feedback, smoothness, delay and emotion.
zh_hans: 你现在可以打开像 Apple Motion 这样的 app，尝试为图层添加一些关键帧，调整关键帧的速度因子。随着你观察和制作更多的动画，你将开始感受到动画的反馈、流畅度、延迟和情感。

# ENDING_SCREEN_SECTION_2_DETAIL_2
source: If you′re planning to use SwiftUI for your app and want to stay up-to-date with the latest APIs from Apple, it′s essential to use the Apple Developer app to watch developer sessions and follow WWDC updates.
zh_hans: 如果你计划在应用程序中使用 SwiftUI，并希望了解来自苹果的最新 API，那么使用苹果开发者应用程序观看开发者会议并关注 WWDC 更新就是至关重要的。

# ENDING_SCREEN_SECTION_2_TITLE
source: There′s more to discover!
zh_hans: 还有更多可以探索！

# ENDING_SCREEN_SECTION_3_DETAIL
source: Thanks for discovering animations with me!
zh_hans: 感谢和我一起探索动画！

# ENDING_SCREEN_SECTION_3_TITLE
source: And lastly…
zh_hans: 最后…

source: Explore
zh_hans: 探索

# EXPLORE_MORE_LINKS
source: Explore More
zh_hans: 相关链接

source: First Keyframe Velocity
zh_hans: 关键帧 1 速度

source: From Wikipedia
zh_hans: 来自 维基百科

source: Hide
zh_hans: 隐藏

source: Keyframe
zh_hans: 关键帧

source: Keyframe 1
zh_hans: 关键帧 1

source: Keyframe 2
zh_hans: 关键帧 2

# KEYFRAME_SCREEN_SECTION_1_DETAIL_1
source: Animation is almost about transition between different objects, or different phases on one object. Keyframes record the “key moment” of one object. Once you have put two or more keyframes on one thing, computer will automatically calculate the value on each frame between two keyframes.
zh_hans: 动画几乎是关于不同对象之间的过渡，或者一个对象上的不同阶段。关键帧记录了一个对象的“关键时刻”。一旦您在一个物体上放置了两个或更多关键帧，计算机将自动计算两个关键帧之间每一帧的值。

# KEYFRAME_SCREEN_SECTION_1_DETAIL_2
source: The ways computer calculate the value can be different. Maybe it′s fast near the start, and slow near the end; or opposite... This is where “smooth” be made.
zh_hans: 计算机计算值的方式可以不同。也许在开始时速度很快，接近结束时速度变慢；或者相反……这就是“平滑”产生的地方。

# KEYFRAME_SCREEN_SECTION_1_TITLE
source: What is keyframe?
zh_hans: 什么是关键帧？

# KEYFRAME_SCREEN_SECTION_2_DETAIL
source: We need to learn about velocity, linear animations and ease-in, ease-out, ease-in-out animations.
zh_hans: 我们需要学习速度、线性动画以及渐入、渐出和渐入渐出动画。

# KEYFRAME_SCREEN_SECTION_2_TITLE
source: How to make it smooth?
zh_hans: 如何变得丝滑？

# KEYFRAME_VELOCITY_SCREEN_DETAIL
source: Look at the Time-Value Chart above these text, this chart shows the relationship between time and animated value (this might be position, scale, opacity etc). The horizontal axis represents time, while the vertical axis represents the animated value.
zh_hans: 请看上面文字上方的时间-值图表，该图表显示了时间和动画值（可能是位置、缩放、不透明度等）之间的关系。水平轴表示时间，垂直轴表示动画值。

# KEYFRAME_VELOCITY_SCREEN_FOOTNOTE
source: But it′s not \"smooth\"…
zh_hans: 但它还不够「丝滑」

# KEYFRAME_VELOCITY_SCREEN_TITLE
source: Time-Value Chart
zh_hans: 时间 - 值图表

source: Lab
zh_hans: 实验室

source: Last Keyframe Velocity
zh_hans: 关键帧 2 速度

source: Learn
zh_hans: 学习

source: Linear
zh_hans: 线性

source: Linear Animation
zh_hans: 线性动画

# LINEAR_ANIMATION_DETAIL_1
source: Linear animation is the animation where object moves at a constant speed.
zh_hans: 线性动画是指物体以恒定速度移动的动画。

# LINEAR_ANIMATION_DETAIL_2
source: In the time-value chart, you can see the velocity (tangent, steepness) does not change with time.
zh_hans: 在时间-值图表中，您可以看到速度（切线、陡峭度）随时间不变。

# MARKVIEW_GREETING_WORDS
source: Hi! I'm...
zh_hans: 你好！我是：

# MARKVIEW_INFORMATION_1
source: Sophomore at Software Engineering
zh_hans: 软件工程专业大二学生

# MARKVIEW_INFORMATION_2
source: Freelance Motion Designer
zh_hans: 自由动态设计师

source: Next
zh_hans: 下一个

source: Non-linear Animation
zh_hans: 非线性动画

# NON_LINEAR_ANIMATION_DETAIL_1
source: Non-linear animation is the animation where object moves at a dynamic speed, we can adjust the Bezier controller of keyframe velocity, to adjust the animation.
zh_hans: 非线性动画是指物体以动态速度移动的动画，我们可以调整关键帧速度的贝塞尔控制器来调整动画。

# NON_LINEAR_ANIMATION_DETAIL_2
source: In the time-value chart, you can see the velocity (tangent, steepness) changes with time.
zh_hans: 在时间-值图表中，您可以看到速度（切线、陡峭度）随时间变化。

# NON_LINEAR_ANIMATION_TITLE
source: What do the time–value mappings of different kinds of animations look like?
zh_hans: 不同类型的动画的时间-值映射是什么样的呢？

source: Pin the Anchor Point
zh_hans: 固定锚点

source: Previous
zh_hans: 上一个

# PRINCIPLE_ANTICIPATION
source: Anticipation
zh_hans: 预期动作

# PRINCIPLE_ANTICIPATION_EXPLANATION
source: Anticipation is used to prepare the audience for an action, and to make the action appear more realistic. A dancer jumping off the floor has to bend the knees first; a golfer making a swing has to swing the club back first. The technique can also be used for less physical actions, such as a character looking off-screen to anticipate someone′s arrival, or attention focusing on an object that a character is about to pick up.
zh_hans: 物体从静止到开始动作前会有所谓的预期动作，可让观众能预知下个动作。 例如从高空往下跳跃时会先弯曲膝盖再跳、正在跑步的人要停止跑步前会逐渐变慢步伐等等。在动画中适当加入预期动作不仅可增添生动性，亦可给予观众惊喜性。

# PRINCIPLE_APPEAL
source: Appeal
zh_hans: 吸引力

# PRINCIPLE_APPEAL_EXPLANATION
source: Appeal in a cartoon character corresponds to what would be called charisma in an actor. A character who is appealing is not necessarily sympathetic; villains or monsters can also be appealing. The important thing is that the viewer feels the character is real and interesting. There are several tricks for making a character connect better with the audience; for likable characters, a symmetrical or particularly baby-like face tends to be effective. A complicated or hard to read face will lack appeal or ′captivation′ in the composition of the pose or character design.
zh_hans: 一部好的动画作品一定会有令人吸引的人事物，例如人物外型鲜明、表态具有特色、完整的高潮迭起剧情都可吸引观众。

# PRINCIPLE_ARC
source: Arc
zh_hans: 弧形

# PRINCIPLE_ARC_EXPLANATION
source: Most natural action tends to follow an arched trajectory, and animation should adhere to this principle by following implied \"arcs\" for greater realism. This technique can be applied to a moving limb by rotating a joint, or a thrown object moving along a parabolic trajectory. The exception is mechanical movement, which typically moves in straight lines. As an object′s speed or momentum increases, arcs tend to flatten out in moving ahead and broaden in turns. In baseball, a fastball would tend to move in a straighter line than other pitches; while a figure skater moving at top speed would be unable to turn as sharply as a slower skater, and would need to cover more ground to complete the turn. An object in motion that moves out of its natural arc for no apparent reason will appear erratic rather than fluid. For example, when animating a pointing finger, the animator should be certain that in all drawings in between the two extreme poses, the fingertip follows a logical arc from one extreme to the next. Traditional animators tend to draw the arc in lightly on the paper for reference, to be erased later.
zh_hans: 凡是具有生命的物体，其移动、动作都不会是完美的直线行进，因此作画时要以自然的弧形方式呈现运动。 例如走路绝不会是笔直的前进、头部转动也都是弧形方式。

# PRINCIPLE_EXAGGERATION
source: Exaggeration
zh_hans: 夸张

# PRINCIPLE_EXAGGERATION_EXPLANATION
source: Exaggeration is an effect especially useful for animation, as animated motions that strive for a perfect imitation of reality can look static and dull. The level of exaggeration depends on whether one seeks realism or a particular style, like a caricature or the style of a specific artist. The classical definition of exaggeration, employed by Disney, was to remain true to reality, just presenting it in a wilder, more extreme form. Other forms of exaggeration can involve the supernatural or surreal, alterations in the physical features of a character; or elements in the storyline itself. It is important to employ a certain level of restraint when using exaggeration. If a scene contains several elements, there should be a balance in how those elements are exaggerated in relation to each other, to avoid confusing or overawing the viewer.
zh_hans: 配合前面的挤压与伸展，加上夸张不符合现实的现象亦是增添动画的张力。 例如在动画中一个人的脸被揍都会往内凹深得很严重、往前冲刺会附加许多的华丽效果、迅速躲过子弹等等。

# PRINCIPLE_FOLLOW_THROUGH_AND_OVERLAPPING
source: Follow through and overlapping
zh_hans: 跟随动作与重叠动作

# PRINCIPLE_FOLLOW_THROUGH_AND_OVERLAPPING_EXPLANATION
source: Follow through and overlapping action is a general heading for two closely related techniques which help to render movement more realistically, and help to give the impression that characters follow the laws of physics, including the principle of inertia. \"Follow through\" means that loosely tied parts of a body should continue moving after the character has stopped and the parts should keep moving beyond the point where the character stopped only to be subsequently \"pulled back\" towards the center of mass or exhibiting various degrees of oscillation damping. \"Overlapping action\" is the tendency for parts of the body to move at different rates (an arm will move on different timing of the head and so on). A third, related technique is \"drag\", where a character starts to move and parts of them take a few frames to catch up. These parts can be inanimate objects like clothing or the antenna on a car, or parts of the body, such as arms or hair. On the human body, the torso is the core, with arms, legs, head and hair appendices that normally follow the torso′s movement. Body parts with much tissue, such as large stomachs and breasts, or the loose skin on a dog, are more prone to independent movement than bonier body parts. Again, exaggerated use of the technique can produce a comical effect, while more realistic animation must time the actions exactly, to produce a convincing result.
zh_hans: 物体因为惯性，要移动中的物体突然停止不动是不可能的，因此就有了跟随动作。例如荡秋千，施一力使秋千摇摆，过不久后会慢慢摇摆到静止，慢慢摇摆的秋千即为跟随动作。 重叠动作也类似如此，不过更强调其动作的注目性。例如一女子不动，风吹拂女子的长发使其左右飘摆，长发左右飘摆即为动画师想要让观众注目的重叠动作。

# PRINCIPLE_SECONDARY_ACTION
source: Secondary action
zh_hans: 附属动作

# PRINCIPLE_SECONDARY_ACTION_EXPLANATION
source: Adding secondary actions to the main action gives a scene more life, and can help to support the main action. A person walking can simultaneously swing their arms or keep them in their pockets, speak or whistle, or express emotions through facial expressions. The important thing about secondary actions is that they emphasize, rather than take attention away from the main action. If the latter is the case, those actions are better left out. For example, during a dramatic movement, facial expressions will often go unnoticed. In these cases, it is better to include them at the beginning and the end of the movement, rather than during.
zh_hans: 附属动作是指在主要动作之外能够帮助角色性格表达的其他动作。例如行走动画中的手臂位置。主要动态是在走路，但是同样是走路，除开腿部的主体动作之外，其他位置状态的不同，那么整体表达也会受影响。手臂提起并握拳那么这个人可能是在很生气的走路，如果手臂前伸并僵直，那么很可能这是一只僵尸在走路。

# PRINCIPLE_SLOW_IN_AND_SLOW_OUT
source: Slow in and slow out
zh_hans: 渐快与渐慢

# PRINCIPLE_SLOW_IN_AND_SLOW_OUT_EXPANATION
source: The movement of objects in the real world, such as the human body, animals, vehicles, etc. needs time to accelerate and slow down. For this reason, more pictures are drawn near the beginning and end of an action, creating a slow in and slow out effect in order to achieve more realistic movements. This concept emphasizes the object′s extreme poses. Inversely, fewer pictures are drawn within the middle of the animation to emphasize faster action. This principle applies to characters moving between two extreme poses, such as sitting down and standing up, but also for inanimate, moving objects, like the bouncing ball in the above illustration.
zh_hans: 物体从静止到移动是渐进加速，移动到静止则是渐进减速，也就是说物体从开始到结束移动并不会是等速度运动。 例如一辆车子不管马力再怎么快，开始移动是渐进加速的，停止移动也会渐缓减速。

# PRINCIPLE_SOLID_DRAWING
source: Solid drawing
zh_hans: 立体造型

# PRINCIPLE_SOLID_DRAWING_EXPLANATION
source: The principle of solid drawing means taking into account forms in three-dimensional space, or giving them volume and weight. The animator needs to be a skilled artist and has to understand the basics of three-dimensional shapes, anatomy, weight, balance, light and shadow, etc. For the classical animator, this involved taking art classes and doing sketches from life. One thing in particular that Johnston and Thomas warned against was creating \"twins\": characters whose left and right sides mirrored each other, and looked lifeless.
zh_hans: 立体造型原则代表考虑在三维空间的形式，给予他们音量和重量。动画制作人需要是一个熟练的技术绘图员， 并且需要理解三维空间形态的基础，解剖，重量，平衡，光影等等。

# PRINCIPLE_SQUASH_AND_STRETCH
source: Squash and stretch
zh_hans: 挤压与伸展

# PRINCIPLE_SQUASH_AND_STRETCH_EXPLANATION
source: The purpose of squash and stretch is to give a sense of weight and flexibility to drawn or computer-animated objects. It can be applied to simple objects, like a bouncing ball, or more complex constructions, like the musculature of a human face. Taken to an extreme, a figure stretched or squashed to an exaggerated degree can have a comical effect. In realistic animation, however, the most important aspect of this principle is that an object′s volume does not change when squashed or stretched. If the length of a ball is stretched vertically, its width (in three dimensions, also its depth) needs to contract correspondingly horizontally.
zh_hans: 主要赋予物体重量与灵活感，借由挤压与伸展来强调瞬间的物理变化。 例如一个具有弹性的球，从空中垂直瞬间落地时，球体会被下向挤压成水平椭圆动与趣味性。

# PRINCIPLE_STAGING
source: Staging
zh_hans: 演出方式

# PRINCIPLE_STAGING_EXPLANATION
source: This principle is akin to staging, as it is known in theatre and film. Its purpose is to direct the audience′s attention, and make it clear what is of greatest importance in a scene; Johnston and Thomas defined it as \"the presentation of any idea so that it is completely and unmistakably clear\", whether that idea is an action, a personality, an expression, or a mood. This can be done by various means, such as the placement of a character in the frame, the use of light and shadow, or the angle and position of the camera. The essence of this principle is keeping focus on what is relevant, and avoiding unnecessary detail.
zh_hans: 每个角色都有其动作与表态，构思角色与场景的呈现，使其更接近真实。 画面所呈现的可能只是角色上半身或者全身、角色以什么动作去跟背景互动、角色前一个动作与下一个动作的关系等等，剧情、分镜、画面、动作、光影都需要相当的构想，使整部动画完整。

# PRINCIPLE_STRAIGHT_AHEAD_ACTION_AND_POSE_TO_POSE
source: Straight-ahead action and pose-to-pose
zh_hans: 接续动作与关键动作

# PRINCIPLE_STRAIGHT_AHEAD_ACTION_AND_POSE_TO_POSE_EXPLANATION
source: These are two different approaches to the drawing process. Straight ahead action scenes are animated frame by frame from beginning to end, while \"pose to pose\" involves starting with drawing key frames, and then filling in the intervals later. \"Straight ahead action\" creates a more fluid, dynamic illusion of movement, and is better for producing realistic action sequences. On the other hand, it is hard to maintain proportions and to create exact, convincing poses along the way. \"Pose to pose\" works better for dramatic or emotional scenes, where composition and relation to the surroundings are of greater importance. A combination of the two techniques is often used.
zh_hans: 传统动画是由数张画面连续显示而构成，近代电脑动画也是如此，从第一格画面显示到最后一格画面就形成了会动的画面。接续动作与关键动作为两种不同的制作动画方式 接续动作是依照连续的动作从第一格画到最后一格的方式。 关键动作是先定义重要的动作并作画，再返回关键动作之间绘制需要的画面。 接续动作法适用较简单的动画，较复杂的动画则是使用关键动作法。

# PRINCIPLE_TIMING
source: Timing
zh_hans: 时间控制

# PRINCIPLE_TIMING_EXPLANATION
source: Timing refers to the number of drawings or frames for a given action, which translates to the speed of the action on film. On a purely physical level, correct timing makes objects appear to obey the laws of physics. For instance, an object′s weight determines how it reacts to an impetus, like a push: a lightweight object will react faster than a heavy one. Timing is critical for establishing a character′s mood, emotion, and reaction. It can also be a device to communicate aspects of a character′s personality.
zh_hans: 控制好物体的动作时间即是动画的灵魂，亦是表现动画节奏的关键。 例如往前出一直拳的动作是瞬间的、在湖中划船是缓慢前进的。

source: Review
zh_hans: 复习

source: Rotation Degrees
zh_hans: 旋转角度

source: Scale Factor
zh_hans: 缩放倍数

source: Show
zh_hans: 显示

source: Show Animation Detail Inside OS
zh_hans: 显示操作系统中的动画细节

source: Start Learning
zh_hans: 开始学习！

source: SwiftUI Animations
zh_hans: SwiftUI 动画

# SWIFTUI_ANIMATIONS_SCREEN_SECTION_1_DETAIL
source: These are SwiftUI′s built-in animations, you can also create your own animation in next chapter.
zh_hans: 这些是 SwiftUI 内置的动画，你也可以在下一章节中创建自己的动画。

# SWIFTUI_ANIMATIONS_SCREEN_SECTION_1_TITLE
source: Discover SwiftUI Animations
zh_hans: 探索 SwiftUI 动画

# SWIFTUI_ANIMATIONS_SCREEN_SECTION_2_DETAIL
source: Ease-In, Ease-Out, Ease-In-Out, Bouncy, Spring...
zh_hans: 渐入、渐出、渐入渐出、弹性…

# SWIFTUI_ANIMATIONS_SCREEN_SECTION_2_TITLE
source: How are they created?
zh_hans: 怎么做？

source: SwiftUI Code
zh_hans: SwiftUI 代码

# SWIFTUI_CODE_ADD_A_VARIABLE
source: Add a Variable
zh_hans: 添加变量

# SWIFTUI_CODE_ADD_BUTTON
source: Add Button or Something That Can Change the Value
zh_hans: 添加按钮（或者任何可以更改变量数值的控件）

# SWIFTUI_CODE_ADD_MODIFIER
source: Add .animation() Modifier
zh_hans: 添加修改器

# SWIFTUI_CODE_ANIMATION_EXPLANATIONS
source: In SwiftUI, an animation consists of two parts, Animatable and Animation.
zh_hans: 在 SwiftUI 中，动画由两部分组成，即 **Animatable** 和 **Animation**。

# SWIFTUI_CODE_ANIMATION_EXPLANATIONS_ANIMATABLE
source: This is an **Animatable** attribute.
zh_hans: 这是 **Animatable**（可动画的）属性。

# SWIFTUI_CODE_ANIMATION_EXPLANATIONS_ANIMATION
source: This is **Animation**.
zh_hans: 这是 **Animation**（动画）。

# SWIFTUI_CODE_CHOOSE_ANIMATION
source: Choose Animation
zh_hans: 选择用什么样的动画

# SWIFTUI_CODE_MAKE_PROPERTY_RELATED_WITH_VARIABLE
source: Make Property You Want to Animate Related with Variable
zh_hans: 将属性与变量关联起来

# SWIFTUI_CODE_SCREEN_SECTION_1_DETAIL
source: We already learned several kinds of animations, so how to add them into your app?
zh_hans: 我们已经学习了几种动画，那么如何将它们添加到你的应用程序中呢？

# SWIFTUI_CODE_SCREEN_SECTION_1_TITLE
source: Discover SwiftUI Codes
zh_hans: 探索 SwiftUI 代码

# SWIFTUI_CODE_SECTION_2_TITLE
source: Anchor Point
zh_hans: 锚点

# SWIFTUI_CODE_SHOW_DETAILS
source: Show SwiftUI Details
zh_hans: 显示 SwiftUI 代码细节

source: Time
zh_hans: 时间

source: Time-Value Chart
zh_hans: 时间 - 值图表

# VARIOUS_CHARTS_SCREEN_TITLE
source: What′s the difference between various kinds of animation?
zh_hans: 不同动画的区别有哪些？
